{"inkVersion":19,"root":[["^Season of Daemons, Day 54, 20 years PNW","\n","^Brief description of the world/location, to set the backdrop of game:","\n","^PNW stands for Post Nuclear War, but not a war as most people would picture it if you told them about it. This was, by all standards, a conventioal war between 2 young super-powers with a few notable exceptions. The vast majority of battles was fought by machines that were either autonomous or remotely controlled from secure and comfortable command centers. As a result, there were very few casualties among military personael of both sides.","\n","^As the conflict dragged on, there was no winner in sight and it soon became clear that the winner would be determined only by who ran out of resources first. But the resourses were still plentiful in the world, so the war could go on for many decades - perhaps even a few centuries at the current pace. Some were quite comfortable with this idea, since to them, it meant buisness opportunity and the the hope that the planet would eventually adjust to this state. This did not sit well with those few who were able to look beyond a single human life span and consider what the world after the conflict would look like.","\n","^A plan was set in motion, all existing archives were comed over for any bit inforamation, no matter its age or size, that could help end the war before the war ended them all. This process took many years and by the time the plan was beginning to form, some of their predictions started coming true: many mining, refining and fabrication companies had appeared and taken root in societies on both sides; the battles that took place no longer dominated the news headlines - only the occasional update would be seen.","\n","^This state of the world lead a radical faction to belive that it was now, or never - something had to be done, or it would be too late. Some years prior, members of this faction had discovered an old and secret location: an bunker located beneath the ocean floor off the coast of a small, neutral country. Inside the bunker were the last nuclear warheads produced before all nuclear weapons were banned and destroyed decades earlier.","\n","^There were 6 of the warheads in total, and their targets were already determined: the capital cities of the warring powers, their main industrial hubs and two key positions on the front lines - one for each army - that would ensure the destruction of as many war machines as possible.","\n","^Plan worked, massive loss of life, governments in ruins, chaos","\n","^Bigger group seeks to bring the faction to justice - basically starts another small war; in the final battle, onle last nuke is detonated - most powerfull & on the ground - heavy environmental damage, climate change, etc","\n","^Transition into description of the current state of the world","\n","^Fusion of \"magic\" and tech","\n","^Average QOL is somewhat lower","\n","^Resources are strictly rationed - preference for more natural materials","\n","^Description of your general mission (more details in char desc)","\n","^You are:","\n","ev","str","^Char_Type_01: \"Magic Archetype\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Char_Type_02: \"Tech Seeker\"","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Char_Type_03\" \"___\"","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"Intro.Chose_Char_01"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Intro.Chose_Char_02"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Intro.Chose_Char_03"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Intro":[{"->":".^.Chose_Char_01"},{"Chose_Char_01":["^Description of char 01","\n","^\"Magic\" comes from radiation-induced mutations; many \"spells\" are based on/influenced by radiation mechanics","\n",{"->":".^.^.FoundPerson"},{"#f":1}],"Chose_Char_02":["^Description of char 01","\n","^Profession; high-sklii & high-danger; search for technology from before the war","\n",{"->":".^.^.FoundPerson"},{"#f":1}],"Chose_Char_03":["^Description of char 01","\n","^Blarg","\n",{"->":".^.^.FoundPerson"},{"#f":1}],"FoundPerson":["^stuff and dialogue","\n","^choices depend on char class","\n","^Person explains what is going one","\n","^Character response:","\n","ev",{"CNT?":".^.^.Chose_Char_01"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Dialogue and choices specific to the first character","\n",["ev",{"^->":"Intro.FoundPerson.11.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Response 01 ",{"->":"$r","var":true},null]}],["ev",{"^->":"Intro.FoundPerson.11.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Response 02 ",{"->":"$r","var":true},null]}],{"->":".^.^.^.12"},{"c-0":["ev",{"^->":"Intro.FoundPerson.11.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"Intro.Responce01"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Intro.FoundPerson.11.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"Intro.Responce03"},"\n",{"#f":5}]}]}],"nop","\n","ev",{"CNT?":".^.^.Chose_Char_02"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Same as first case","\n",["ev",{"^->":"Intro.FoundPerson.17.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Tired Traveler: Probably Just Another Dead End ",{"->":"$r","var":true},null]}],["ev",{"^->":"Intro.FoundPerson.17.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Optimistic Noob: Maybe This Will Lead Somewhere? ",{"->":"$r","var":true},null]}],{"->":".^.^.^.18"},{"c-0":["ev",{"^->":"Intro.FoundPerson.17.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","ev",3,"/ev",{"VAR=":"CharSubType","re":true},{"->":"Intro.Responce03"},{"#f":5}],"c-1":["ev",{"^->":"Intro.FoundPerson.17.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",1,"/ev",{"VAR=":"CharSubType","re":true},{"->":"Intro.Responce01"},{"#f":5}]}]}],"nop","\n","ev",{"CNT?":".^.^.Chose_Char_03"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Same as first and second case","\n",["ev",{"^->":"Intro.FoundPerson.23.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Response 01 ",{"->":"$r","var":true},null]}],["ev",{"^->":"Intro.FoundPerson.23.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Response 02 ",{"->":"$r","var":true},null]}],{"->":".^.^.^.24"},{"c-0":["ev",{"^->":"Intro.FoundPerson.23.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"Intro.Responce02"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Intro.FoundPerson.23.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],{"->":"Intro.Responce04"},"\n",{"#f":5}]}]}],"nop","\n",{"#f":1}],"Responce01":["^Some responce 01","\n",{"->":".^.^.IntroEnd"},{"#f":1}],"Responce02":["^Some responce 02","\n",{"->":".^.^.IntroEnd"},{"#f":1}],"Responce03":["^Hey old man, you from, uh, [town name]?","\n","^I'm looking for an old military base, was told it would be somewhere around here - do you know where it might be?","\n",{"->":".^.^.IntroEnd"},{"#f":1}],"Responce04":["^Some responce 04","\n",{"->":".^.^.IntroEnd"},{"#f":1}],"IntroEnd":[["^[Man responds, corrects town name]","\n","^[He is from the town - he is the herbalist]","\n","ev",{"CNT?":"Intro.Responce01"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^[You ask what a herbalist is, exactly and why the town doesn't have a Auto-Clinic]","\n","^[He explains what a herbalist is and that the people of his town don't trust high technology and many blame it for the current state of the world]","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"CNT?":"Intro.Responce03"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Herbalist huh? So it's that bad around here...","\n","^[Man is a bit ofended, says the people of his town don't trust high technology]","\n","^Oh really? Then how do you defend agains bandits, mutants and war bots?","\n","^[Man explains that there is nobody here but the town]","\n","^Fine, good for all of you. So how about that old base - do you know where it is?","\n","^[Man says that there is no base around here - only a few war ruins and a zone behind a nearby hill that was marked as dengerous by the town's founders where nobody goes]","\n","^(Thoughts::)*A danger zone created by the founders of a town that hate hight technology, but know enough to mark off a danger zone and maintain it for years? Sounds like they don't want people to find out what's really inside it.*","\n","^So these Founders have been all around this area?","\n","^[Man affirms - says that they spent years looking for a perfect place to set up a small, independant town, so if you go into town an talk to them, they might be able to help out]","\n",{"->":".^.^.^.14"},null]}],"nop","\n","ev","str","^Go to the town first","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go Straight to the Zone","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ","\n","ev",{"CNT?":"Intro.Responce03"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Thanks for the tip, I'll go do that.","\n",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"CNT?":"Intro.Responce01"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Thank you sir! I'm sure they'll have some information that I could use!","\n",{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"Main_Location_Town"},{"#f":5}],"c-1":["^ ",{"->":"Main_Location_OldBase"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"Main_Location_Town":["^some more dialogue and/or background","\n","^likely find some clues and/or equipmanet","\n","^once ready, go to the old base","\n",{"->":"Main_Location_OldBase"},{"#f":1}],"Main_Location_OldBase":[{"->":".^.Approaching_Base"},{"Approaching_Base":[["ev",{"CNT?":"Intro.Chose_Char_02"},{"VAR?":"CharSubType"},3,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n","^[You catiously creep through the brush, it's been almost 20 minutes since you passed the warning labels, sou you must be well inside the zone at this point, but there is still nothing around you but heavy forest and occasional dead tree]","\n","^[Finally, after another 20 minutes have passed, you see a clearing in the woods]","\n","^[Just as you are about to step out into the open, you traking alarm goes off!]","\n","^[Before you can even start wondering what could have set it off in the middle of nowhere, you reflexes take over and you dive behind the nearest tree!]","\n","^[A minute goes by and nothing happens. You peek out into the clearing from behind the tree, your artificial eye zooming in as much as it can...]","\n","^[Then you see it - a grey, reinforced concrete wall, full of craks and holes, slowly being taken over by vines. On top of the wall, at regular intervals, you spot automated defence turrets: the old military base!]","\n","^A few of the turrets are missing, or look damaged, but it's hard to say for sure from this distance. The base, according to the mission was a small one, dug into the hillside and used as one of many controll centers during the robo-wars. These bases were rarely attacked, as there were hundreds of them onn both sides and they were all redundant anyway - you would have to find and destroy dosens of them before seeing any effect.","\n","^[You reach down and activate a small device on your belt - it's a signal emmiter, designed to fool the base's computer into thinking you are one of the soliders stationed there.]","\n","^[You step out from behind the tree and start walking towards the base, hopint that nobody has occupied it ... or that this base was not run by an AI]","\n","^[After a few minutes pass and nothing happens, you allow yourself to relax. The turrets are still tracking you, but it is unclear if they are out of ammo or the emitter you were given worls as it should. ]","\n","^[You slow down as you approach the wall - the turrets have turned away, so you debate your next move: go over the wall, or walk along it to reach the front gate]","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"CNT?":"Intro.Chose_Char_02"},{"VAR?":"CharSubType"},1,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n","^...","\n",{"->":".^.^.^.18"},null]}],"nop","\n","ev","str","^Try going over the wall","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Try following the wall to the front gate","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^[The wall is only 2 meters tall and there are enough dents and cracks for you to efortlessly climb over it. As you peek over the top, you see that the area inside the wall is split into two uneven parts, separated by a similar wall. You end up on the smaller, inner courtyard - empty, save for a few crumbling buildings.]","\n","^[After a brief scan of the courtyard, you head tpwards the entrance to the heart of the base, the heavy doors slightly adjar - enough for two average people to walk through side-by-side.]","\n",{"->":".^.^.^.^.Exploring_Base"},{"#f":5}],"c-1":["\n","^[]","\n",{"->":".^.^.^.^.Entering_Base"},{"#f":5}]}],{"#f":1}],"Entering_Base":["ev",{"CNT?":"Intro.Chose_Char_02"},{"VAR?":"CharSubType"},3,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n","^There is no front gate - only a small, closed door, likely made from steel or titanium - no use trying to force it open.","\n","^[You don't risk kicking the door - one will likely not do it and if anyone is inside, one kick will be enough to alert them.]","\n","^[You decide to walk back and try climbing over the wall.]","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"CNT?":"Intro.Chose_Char_02"},{"VAR?":"CharSubType"},1,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n","^...","\n",{"->":".^.^.^.18"},null]}],"nop","\n",{"->":".^.^.Exploring_Base"},{"#f":1}],"Exploring_Base":[["^Empty","\n","^Dusty","\n","^No visible battle damage","\n","^Only a few low-power LEDs - not even emergeny lighting","\n","^\"Make your way to the base's power room - there is a device there. Extract it and bring it back here. You'll know it when you see it.\"","\n","^Junktion: to the right, a coridor marked \"Reactor\", to the left, a narrow and unmarked passage with a heavy-looking security door at the end.","\n","ev","str","^Go straight to the reactor room","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Check the door on the left","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":".^.^.^.^.ReactorRoom"},{"#f":5}],"c-1":["\n","^It's locked shut and there is no keypad or any other lock you might think of.","\n","^Nothing else to do but turn around and go into the reactor room.","\n",{"->":".^.^.^.^.ReactorRoom"},{"#f":5}]}],{"#f":1}],"ReactorRoom":["^Room looks like the rest of the base.","\n","^See device","\n","^Exposition through flashbacks","\n","^Base suddenly powers on, but as you near the exit, the reactor starts breack down - alarm goes off","\n",{"->":".^.^.Escaping_Base"},{"#f":1}],"Escaping_Base":["^Run out of the room","\n","^Glance to the right - security door is open, corridor on the other side was once white, but is now almost all covered in red","\n","^Run outside, explosion behind you","\n","end",{"#f":1}],"#f":1}],"global decl":["ev",0,{"VAR=":"CharSubType"},"/ev","end",null],"#f":1}],"listDefs":{}}